<?php
// +----------------------------------------------------------------------
// | ThinkPHP Webworker [Webworker Extension For ThinkPHP]
// +----------------------------------------------------------------------
// | ThinkPHP Webworker 扩展
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: axguowen <axguowen@qq.com>
// +----------------------------------------------------------------------

return [
    // 进程名称, 方便status命令中查看统计
    'name' => 'think-webworker',
    // 进程数量
    'count' => 1,
    // 是否以守护进程启动
    'daemonize' => false,
    // 监听地址
    'host' => '0.0.0.0',
    // 监听端口
    'port' => 8989,
    // 静态文件支持
    'static_support' => false,
    // 包大小限制
    'max_package_size' => 10 * 1024 * 1024,
    // 请求一定数量后，退出进程重开，防止内存溢出
    'request_limit' => 10000,
	// 应用入口文件配置
	'app_entrance_files' => [],
];
